load-tests/scenarios/load-test.yml
config:
  target: "{{ $env.WABOT_STAGING_BASE }}"
  http:
    timeout: 5
    # Shared connection pool (per worker process) — same rationale as
    # to-failure.yml: one-socket-per-VU + think:30 piles up thousands of
    # concurrent connections and latched Railway's edge on 2026-07-08
    # (service-wide inbound blackout). Meta delivers webhooks over a few
    # reused connections, so a small pool is also the truer load model.
    pool: 125
  processor: "../processors/webhook.js"
  # ---------------------------------------------------------------------
  # Capacity-pinning ladder. The 10x ladder from #23 / #24 bracketed
  # capacity between step_10 (20 webhooks/s, clean) and step_100 (200
  # webhooks/s, collapsed) — too coarse to land on a number.
  # 2026-06-26 run sustained ~123 webhooks/s through the broken plateaus
  # before artillery's connection pool was saturated by timeouts, so the
  # actual ceiling is somewhere in 100–200 webhooks/s.
  #
  # This ladder samples that band at ~30 webhooks/s resolution. Each VU
  # fires phase_1 + phase_2, so combined webhook rate is 2 × arrivalRate.
  # The "last passing plateau" defines sustained user capacity:
  #
  #   simultaneous-users = last-passing-arrivalRate * 30 s
  #
  # because each real user sends roughly one message per 30 s.
  #
  # Plateaus are 120 s — long enough that pp_bullmq_queue_depth /
  # dwell-p95 reach steady state (typical convergence ~30 s) AND short
  # enough that the whole ladder fits inside the 12-min step timeout
  # added in #24 (so artillery exits naturally and report.json is
  # written). Total declared runtime: 30 + 5*120 = 630 s = 10.5 min.
  # ---------------------------------------------------------------------
  phases:
    - name: warmup
      duration: 30
      arrivalRate: 5
    - name: step_30
      duration: 120
      arrivalRate: 30 # 60 webhooks/s — confirmed safe
    - name: step_50
      duration: 120
      arrivalRate: 50 # 100 webhooks/s — comfortable headroom
    - name: step_60
      duration: 120
      arrivalRate: 60 # 120 webhooks/s — at observed sustained rate
    - name: step_75
      duration: 120
      arrivalRate: 75 # 150 webhooks/s — first danger plateau
    - name: step_90
      duration: 120
      arrivalRate: 90 # 180 webhooks/s — just below known-broken 200

scenarios:
  - name: webhook
    flow:
      - function: prepareWebhook
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: "{{ signature }}"
            x-test-phase: phase_1
          body: "{{ payload }}"
      # 30 s think between phase_1 and phase_2. Above wabot's 25 s
      # consecutive-check TTL so phase_2 takes the non-consecutive
      # lesson-flow path (more realistic than the prior `think: 2` which
      # short-circuited that branch). At 90 VU/s × ~35 s VU lifetime ≈
      # 3 150 concurrent VUs — well within artillery memory budget on
      # one GHA runner, so the previous `workers: 8` is not needed.
      - think: 30
      - function: prepareWebhookFollowUp
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: "{{ signature }}"
            x-test-phase: phase_2
          body: "{{ payload }}"