load-tests/scenarios/load-test.yml
config:
  target: "{{ $env.WABOT_STAGING_BASE }}"
  http:
    timeout: 10
  processor: "../processors/webhook.js"
  # Baseline run targets ~2 rps sustained — low enough that the current
  # default BullMQ worker concurrency (1) can keep up, so phase_2 messages
  # aren't stale-dropped by pp-sketch's 20s timestamp guard. Yesterday's
  # 5 rps run lost ~28% of phase_2 messages to stale-timestamp. Raise this
  # once worker concurrency is tuned.
  phases:
    - name: warmup
      duration: 60
      arrivalRate: 1
    - name: sustained
      duration: 240
      arrivalRate: 2

scenarios:
  - name: webhook
    flow:
      - function: prepareWebhook
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: "{{ signature }}"
            x-test-phase: phase_1
          body: "{{ payload }}"
      - think: 120
      - function: prepareWebhookFollowUp
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: "{{ signature }}"
            x-test-phase: phase_2
          body: "{{ payload }}"