load-tests/scenarios/load-test.yml
config:
  target: '{{ $env.WABOT_STAGING_BASE }}'
  http:
    timeout: 5
    # Shared connection pool (per worker process). One-socket-per-VU +
    # think:30 piles up concurrent connections and latched Railway's edge
    # on 2026-07-08 (service-wide inbound blackout). Meta delivers webhooks
    # over a few reused connections, so a small pool is also the truer
    # load model.
    pool: 125
  processor: '../processors/webhook.js'
  # ---------------------------------------------------------------------
  # Post-merge production-assurance gate (2026-07-08 redesign).
  #
  # This is NOT a capacity ladder any more — capacity discovery lives in
  # to-failure.yml (dispatch manually). Ceiling was measured 2026-07-08:
  # ingest >1,200 webhooks/s clean; end-to-end pipeline ~390-450 msgs/s
  # (10 replicas) / ~120-150 msgs/s (2 replicas), PostgreSQL-bound.
  #
  # This gate proves every merge still serves the BUSINESS TARGET:
  # 1,000 DAU with 100 simultaneous users. 100 simultaneous users at one
  # message per ~30 s = 3.3 msgs/s. arrivalRate 2 with the two-phase flow
  # sustains 4 webhooks/s ≈ 120 simultaneous users ≈ 2,900 DAU-equivalent
  # — the target plus ~20% margin.
  #
  # HARD PASS/FAIL (ensure plugin): artillery exits non-zero when a
  # strict check fails, the workflow run goes red, and the daily digest
  # (which reads gh_runs conclusions) leads with the failure. Thresholds
  # are calibrated ~5-20x above healthy baseline (ack p95 measured
  # 25-116 ms across 2026-07-08 runs), so they trip on genuine
  # degradation, not noise.
  #
  # Runtime: 15 s warmup + 240 s plateau + ~35 s drain ≈ 5 min.
  # ---------------------------------------------------------------------
  plugins:
    ensure:
      thresholds:
        - 'http.response_time.p95': 500
        - 'http.response_time.p99': 1500
      conditions:
        # Any webhook that errored or timed out fails the gate outright.
        - expression: 'vusers.failed == 0'
          strict: true
        # Guard against a silently-empty run passing (DNS failure, wrong
        # target, artillery bug): the 240 s plateau at 2 VU/s must have
        # actually created its ~495 VUs.
        - expression: 'vusers.created > 400'
          strict: true
  ensure:
    maxErrorRate: 0
  phases:
    - name: warmup
      duration: 15
      arrivalRate: 1
    - name: target_load
      duration: 240
      arrivalRate: 2 # 4 webhooks/s sustained ≈ 120 simultaneous users

scenarios:
  - name: webhook
    flow:
      - function: prepareWebhook
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: '{{ signature }}'
            x-test-phase: phase_1
          body: '{{ payload }}'
      # 30 s think between phase_1 and phase_2 — above wabot's 25 s
      # consecutive-check TTL so phase_2 exercises the lesson-flow path.
      - think: 30
      - function: prepareWebhookFollowUp
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: '{{ signature }}'
            x-test-phase: phase_2
          body: '{{ payload }}'