load-tests/scenarios/load-test.yml
config:
  target: "{{ $env.WABOT_STAGING_BASE }}"
  http:
    # Each failed request waits `timeout` seconds before artillery declares
    # it dead. The 2026-06-25 run hit step_100 collapse with timeout: 30
    # — artillery drained ~9.5 min of pending VUs after the last phase,
    # blowing the 25-min staging.yml job budget. 5 s is well above a
    # healthy wabot /webhook ack (sub-200 ms) and caps drain at ~1/6th.
    timeout: 5
  # Run artillery across 8 worker processes so a single 2-vCPU GitHub
  # Actions runner can attempt the high-rate plateaus. Single-process
  # artillery saturates well below step_1000, much less step_10000.
  workers: 8
  processor: "../processors/webhook.js"
  # ---------------------------------------------------------------------
  # Step-ladder capacity test. Each plateau is a 10x arrival-rate jump.
  # The breakpoint is the highest plateau where ALL of:
  #   pp_bullmq_queue_depth{state="waiting"} stays ~0
  #   histogram_quantile(0.95, pp_bullmq_job_dwell_duration_ms ...) < 500 ms
  #   no PG "too many connections" / "ECONNREFUSED" log lines
  # User capacity at 1 msg / 30 s cadence = (last-passing arrivalRate) * 30.
  #
  # NOTE on artillery feasibility: step_10000 means 10 000 virtual users
  # spawned per second. A single GitHub Actions runner cannot actually
  # generate that load — artillery itself saturates around 1-5 k VU/s
  # depending on CPU. If `scenarios.launched` in the artillery report
  # tops out well below 10 000 during the step_10000 plateau the SYSTEM
  # has capacity headroom we can't measure from this rig — move to a
  # distributed runner to push harder.
  # ---------------------------------------------------------------------
  phases:
    - name: warmup
      duration: 60
      arrivalRate: 1
    - name: step_10
      duration: 90
      arrivalRate: 10
    - name: step_100
      duration: 120
      arrivalRate: 100
    - name: step_1000
      duration: 180
      arrivalRate: 1000
    - name: step_10000
      duration: 180
      arrivalRate: 10000

scenarios:
  - name: webhook
    flow:
      - function: prepareWebhook
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: "{{ signature }}"
            x-test-phase: phase_1
          body: "{{ payload }}"
      # Short think between phase_1 and phase_2. The previous 120 s value
      # exceeded the 25 s wabot consecutive-check TTL so phase_2 took the
      # non-consecutive lesson-flow path, but at the ladder's high-rate
      # plateaus a 120 s think pins ~125 s of state per VU in artillery
      # memory — 10 000 VU/s × 125 s ≈ 1.25 M concurrent VUs, which would
      # OOM the GHA runner before step_10000 even starts. 2 s keeps each
      # VU's footprint short so the generator can keep up; phase_2 is
      # then treated as consecutive (within the 25 s TTL), which is
      # acceptable for a capacity test (we're measuring throughput, not
      # lesson-flow code coverage).
      - think: 2
      - function: prepareWebhookFollowUp
      - post:
          url: /webhook
          headers:
            content-type: application/json
            x-hub-signature-256: "{{ signature }}"
            x-test-phase: phase_2
          body: "{{ payload }}"